#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
data.cloudflare_zone.lilja_dot_io: Reading...
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"]: Refreshing state... [id=17f1e94ab3576c93296900f09c2cad2f]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"]: Refreshing state... [id=2b9dab6700df6f8a389c327483b1a045]
data.cloudflare_zone.lilja_dot_io: Read complete after 0s [id=801ec7bc35b2abc9580d847c7b5c6f56]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["_dmarc-v=DMARC1; p=quarantine"]: Refreshing state... [id=34dcc8e8ec712be680b004d4071f5a89]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["lilja.io-v=spf1 include:_spf.protonmail.ch mx ~all"]: Refreshing state... [id=27880e7ae87be1c5dcdde52d5763dfb4]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["lilja.io-protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"]: Refreshing state... [id=91f6606f599ea13775f2eab5d362c384]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail._domainkey-protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."]: Refreshing state... [id=cd3bbd6e0352097c0c5651ff95a37988]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail2._domainkey-protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."]: Refreshing state... [id=ddb7f0e8bcc1a92e83459eb5643e2827]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail3._domainkey-protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."]: Refreshing state... [id=e8665c888f0006a9b36f38ae80b860d1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"] has moved to module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail._domainkey-protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."]
    resource "cloudflare_record" "cname_records" {
        id              = "cd3bbd6e0352097c0c5651ff95a37988"
        name            = "protonmail._domainkey"
        tags            = []
        # (12 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"] has moved to module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail2._domainkey-protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."]
    resource "cloudflare_record" "cname_records" {
        id              = "ddb7f0e8bcc1a92e83459eb5643e2827"
        name            = "protonmail2._domainkey"
        tags            = []
        # (12 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"] has moved to module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail3._domainkey-protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."]
    resource "cloudflare_record" "cname_records" {
        id              = "e8665c888f0006a9b36f38ae80b860d1"
        name            = "protonmail3._domainkey"
        tags            = []
        # (12 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"] will be destroyed
  # (because cloudflare_record.mx_proton_mail is not in configuration)
  - resource "cloudflare_record" "mx_proton_mail" {
      - allow_overwrite = false -> null
      - comment         = "MX records for lilja.io zone." -> null
      - content         = "mail.protonmail.ch" -> null
      - created_on      = "2025-02-01T20:41:00.745141Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "17f1e94ab3576c93296900f09c2cad2f" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:41:00.745141Z" -> null
      - name            = "lilja.io" -> null
      - priority        = 1 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "MX" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"] will be destroyed
  # (because cloudflare_record.mx_proton_mail is not in configuration)
  - resource "cloudflare_record" "mx_proton_mail" {
      - allow_overwrite = false -> null
      - comment         = "MX records for lilja.io zone." -> null
      - content         = "mailsec.protonmail.ch" -> null
      - created_on      = "2025-02-01T20:40:59.979317Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "2b9dab6700df6f8a389c327483b1a045" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:59.979317Z" -> null
      - name            = "lilja.io" -> null
      - priority        = 2 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "MX" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_records["mail.protonmail.ch"] will be created
  + resource "cloudflare_record" "mx_records" {
      + allow_overwrite = false
      + comment         = "MX records for lilja.io zone."
      + content         = "mail.protonmail.ch"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 1
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_records["mailsec.protonmail.ch"] will be created
  + resource "cloudflare_record" "mx_records" {
      + allow_overwrite = false
      + comment         = "MX records for lilja.io zone."
      + content         = "mailsec.protonmail.ch"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 2
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_dmarc has moved to module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["_dmarc-v=DMARC1; p=quarantine"]
    resource "cloudflare_record" "txt_records" {
        id              = "34dcc8e8ec712be680b004d4071f5a89"
        name            = "_dmarc"
        tags            = []
        # (12 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_protomain_verification has moved to module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["lilja.io-protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"]
    resource "cloudflare_record" "txt_records" {
        id              = "91f6606f599ea13775f2eab5d362c384"
        name            = "lilja.io"
        tags            = []
        # (12 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_spf1 has moved to module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["lilja.io-v=spf1 include:_spf.protonmail.ch mx ~all"]
    resource "cloudflare_record" "txt_records" {
        id              = "27880e7ae87be1c5dcdde52d5763dfb4"
        name            = "lilja.io"
        tags            = []
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*